package Seminars.Seminar_1;

public class Task_2 {
    public static void main (String[] args){
        int arr [] = {3, 2, 2, 3};



    }
}



// import java.util.Arrays;

//Дан массив nums = [3,2,2,3] и число val = 3.
//        Если в массиве есть числа, равные заданному, нужно перенести эти элементы в конец массива.
//        Таким образом, первые несколько (или все) элементов массива должны быть отличны от заданного, а остальные - равны ему.

// public class Main {
//     public static void main(String[] args) {
//         var array = new int[] {3, 2, 2, 3, 4,35,3,24,234,4,23,52,2,2,3,3,5,6565,3,55,3};
//         var val = 3;

//         boolean swap = true;
//         while (swap)
//         {
//             swap = false;
//             for (int i=0; i<array.length - 1; i++) {
//                 if (array[i] == 3 && array[i + 1] != 3){
//                     var temp = array[i + 1];
//                     array[i + 1] = array[i];
//                     array[i] = temp;
//                     swap = true;
//                 }
//             }
//         }

//         System.out.println(Arrays.toString(array));
//     }
// }